espressif/esp-idf/components/soc/esp32h2/register/soc/interrupt_matrix_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** INTMTX_CORE0_PMU_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PMU_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x0)
/** INTMTX_CORE0_PMU_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PMU_INTR mapping register
 */
#define INTMTX_CORE0_PMU_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PMU_INTR_MAP_M  (INTMTX_CORE0_PMU_INTR_MAP_V << INTMTX_CORE0_PMU_INTR_MAP_S)
#define INTMTX_CORE0_PMU_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PMU_INTR_MAP_S  0

/** INTMTX_CORE0_EFUSE_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_EFUSE_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x4)
/** INTMTX_CORE0_EFUSE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_EFUSE_INTR mapping register
 */
#define INTMTX_CORE0_EFUSE_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_EFUSE_INTR_MAP_M  (INTMTX_CORE0_EFUSE_INTR_MAP_V << INTMTX_CORE0_EFUSE_INTR_MAP_S)
#define INTMTX_CORE0_EFUSE_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_EFUSE_INTR_MAP_S  0

/** INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x8)
/** INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LP_RTC_TIMER_INTR mapping register
 */
#define INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_M  (INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_V << INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_S)
#define INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_RTC_TIMER_INTR_MAP_S  0

/** INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc)
/** INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LP_BLE_TIMER_INTR mapping register
 */
#define INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_M  (INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_V << INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_S)
#define INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_BLE_TIMER_INTR_MAP_S  0

/** INTMTX_CORE0_LP_WDT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x10)
/** INTMTX_CORE0_LP_WDT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LP_WDT_INTR mapping register
 */
#define INTMTX_CORE0_LP_WDT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_WDT_INTR_MAP_M  (INTMTX_CORE0_LP_WDT_INTR_MAP_V << INTMTX_CORE0_LP_WDT_INTR_MAP_S)
#define INTMTX_CORE0_LP_WDT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_WDT_INTR_MAP_S  0

/** INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x14)
/** INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LP_PERI_TIMEOUT_INTR mapping register
 */
#define INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_M  (INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_V << INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_S)
#define INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_PERI_TIMEOUT_INTR_MAP_S  0

/** INTMTX_CORE0_LP_APM_M0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_LP_APM_M0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x18)
/** INTMTX_CORE0_LP_APM_M0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_LP_APM_M0_INTR mapping register
 */
#define INTMTX_CORE0_LP_APM_M0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_LP_APM_M0_INTR_MAP_M  (INTMTX_CORE0_LP_APM_M0_INTR_MAP_V << INTMTX_CORE0_LP_APM_M0_INTR_MAP_S)
#define INTMTX_CORE0_LP_APM_M0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_LP_APM_M0_INTR_MAP_S  0

/** INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_REG (DR_REG_INTMTX_BASE + 0x1c)
/** INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CPU_INTR_FROM_CPU_0 mapping register
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP    0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_M  (INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_V << INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_S)
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_V  0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_0_MAP_S  0

/** INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_REG (DR_REG_INTMTX_BASE + 0x20)
/** INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CPU_INTR_FROM_CPU_1 mapping register
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP    0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_M  (INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_V << INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_S)
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_V  0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_1_MAP_S  0

/** INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_REG (DR_REG_INTMTX_BASE + 0x24)
/** INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CPU_INTR_FROM_CPU_2 mapping register
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP    0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_M  (INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_V << INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_S)
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_V  0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_2_MAP_S  0

/** INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_REG (DR_REG_INTMTX_BASE + 0x28)
/** INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CPU_INTR_FROM_CPU_3 mapping register
 */
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP    0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_M  (INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_V << INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_S)
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_V  0x0000001FU
#define INTMTX_CORE0_CPU_INTR_FROM_CPU_3_MAP_S  0

/** INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x2c)
/** INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_ASSIST_DEBUG_INTR mapping register
 */
#define INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_M  (INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_V << INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_S)
#define INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ASSIST_DEBUG_INTR_MAP_S  0

/** INTMTX_CORE0_TRACE_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TRACE_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x30)
/** INTMTX_CORE0_TRACE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_TRACE_INTR mapping register
 */
#define INTMTX_CORE0_TRACE_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TRACE_INTR_MAP_M  (INTMTX_CORE0_TRACE_INTR_MAP_V << INTMTX_CORE0_TRACE_INTR_MAP_S)
#define INTMTX_CORE0_TRACE_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TRACE_INTR_MAP_S  0

/** INTMTX_CORE0_CACHE_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CACHE_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x34)
/** INTMTX_CORE0_CACHE_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CACHE_INTR mapping register
 */
#define INTMTX_CORE0_CACHE_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_CACHE_INTR_MAP_M  (INTMTX_CORE0_CACHE_INTR_MAP_V << INTMTX_CORE0_CACHE_INTR_MAP_S)
#define INTMTX_CORE0_CACHE_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_CACHE_INTR_MAP_S  0

/** INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x38)
/** INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_CPU_PERI_TIMEOUT_INTR mapping register
 */
#define INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_M  (INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_V << INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_S)
#define INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_CPU_PERI_TIMEOUT_INTR_MAP_S  0

/** INTMTX_CORE0_BT_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x3c)
/** INTMTX_CORE0_BT_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_BT_MAC_INTR mapping register
 */
#define INTMTX_CORE0_BT_MAC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BT_MAC_INTR_MAP_M  (INTMTX_CORE0_BT_MAC_INTR_MAP_V << INTMTX_CORE0_BT_MAC_INTR_MAP_S)
#define INTMTX_CORE0_BT_MAC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_MAC_INTR_MAP_S  0

