espressif/esp-idf/components/soc/esp32h2/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_BT_BB_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_BB_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x40)
/** INTMTX_CORE0_BT_BB_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_BT_BB_INTR mapping register
 */
#define INTMTX_CORE0_BT_BB_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BT_BB_INTR_MAP_M  (INTMTX_CORE0_BT_BB_INTR_MAP_V << INTMTX_CORE0_BT_BB_INTR_MAP_S)
#define INTMTX_CORE0_BT_BB_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_BB_INTR_MAP_S  0

/** INTMTX_CORE0_BT_BB_NMI_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BT_BB_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x44)
/** INTMTX_CORE0_BT_BB_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_BT_BB_NMI mapping register
 */
#define INTMTX_CORE0_BT_BB_NMI_MAP    0x0000001FU
#define INTMTX_CORE0_BT_BB_NMI_MAP_M  (INTMTX_CORE0_BT_BB_NMI_MAP_V << INTMTX_CORE0_BT_BB_NMI_MAP_S)
#define INTMTX_CORE0_BT_BB_NMI_MAP_V  0x0000001FU
#define INTMTX_CORE0_BT_BB_NMI_MAP_S  0

/** INTMTX_CORE0_COEX_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_COEX_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x48)
/** INTMTX_CORE0_COEX_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_COEX_INTR mapping register
 */
#define INTMTX_CORE0_COEX_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_COEX_INTR_MAP_M  (INTMTX_CORE0_COEX_INTR_MAP_V << INTMTX_CORE0_COEX_INTR_MAP_S)
#define INTMTX_CORE0_COEX_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_COEX_INTR_MAP_S  0

/** INTMTX_CORE0_BLE_TIMER_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x4c)
/** INTMTX_CORE0_BLE_TIMER_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_BLE_TIMER_INTR mapping register
 */
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_M  (INTMTX_CORE0_BLE_TIMER_INTR_MAP_V << INTMTX_CORE0_BLE_TIMER_INTR_MAP_S)
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BLE_TIMER_INTR_MAP_S  0

/** INTMTX_CORE0_BLE_SEC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x50)
/** INTMTX_CORE0_BLE_SEC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_BLE_SEC_INTR mapping register
 */
#define INTMTX_CORE0_BLE_SEC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_M  (INTMTX_CORE0_BLE_SEC_INTR_MAP_V << INTMTX_CORE0_BLE_SEC_INTR_MAP_S)
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_BLE_SEC_INTR_MAP_S  0

/** INTMTX_CORE0_ZB_MAC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x54)
/** INTMTX_CORE0_ZB_MAC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_ZB_MAC_INTR mapping register
 */
#define INTMTX_CORE0_ZB_MAC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_M  (INTMTX_CORE0_ZB_MAC_INTR_MAP_V << INTMTX_CORE0_ZB_MAC_INTR_MAP_S)
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_ZB_MAC_INTR_MAP_S  0

/** INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_REG (DR_REG_INTMTX_BASE + 0x58)
/** INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_GPIO_INTERRUPT_PRO mapping register
 */
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP    0x0000001FU
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_M  (INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_V << INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_S)
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_V  0x0000001FU
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_MAP_S  0

/** INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_REG (DR_REG_INTMTX_BASE + 0x5c)
/** INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_GPIO_INTERRUPT_PRO_NMI mapping register
 */
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP    0x0000001FU
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_M  (INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_V << INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_S)
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_V  0x0000001FU
#define INTMTX_CORE0_GPIO_INTERRUPT_PRO_NMI_MAP_S  0

/** INTMTX_CORE0_PAU_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PAU_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x60)
/** INTMTX_CORE0_PAU_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PAU_INTR mapping register
 */
#define INTMTX_CORE0_PAU_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PAU_INTR_MAP_M  (INTMTX_CORE0_PAU_INTR_MAP_V << INTMTX_CORE0_PAU_INTR_MAP_S)
#define INTMTX_CORE0_PAU_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PAU_INTR_MAP_S  0

/** INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x64)
/** INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_HP_PERI_TIMEOUT_INTR mapping register
 */
#define INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_M  (INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_V << INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_S)
#define INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_HP_PERI_TIMEOUT_INTR_MAP_S  0

/** INTMTX_CORE0_HP_APM_M0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_HP_APM_M0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x68)
/** INTMTX_CORE0_HP_APM_M0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_HP_APM_M0_INTR mapping register
 */
#define INTMTX_CORE0_HP_APM_M0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_HP_APM_M0_INTR_MAP_M  (INTMTX_CORE0_HP_APM_M0_INTR_MAP_V << INTMTX_CORE0_HP_APM_M0_INTR_MAP_S)
#define INTMTX_CORE0_HP_APM_M0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_HP_APM_M0_INTR_MAP_S  0

/** INTMTX_CORE0_HP_APM_M1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_HP_APM_M1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0x6c)
/** INTMTX_CORE0_HP_APM_M1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_HP_APM_M1_INTR mapping register
 */
#define INTMTX_CORE0_HP_APM_M1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_HP_APM_M1_INTR_MAP_M  (INTMTX_CORE0_HP_APM_M1_INTR_MAP_V << INTMTX_CORE0_HP_APM_M1_INTR_MAP_S)
#define INTMTX_CORE0_HP_APM_M1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_HP_APM_M1_INTR_MAP_S  0

