espressif/esp-idf/components/soc/esp32h2/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_TG0_T0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG0_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa4)
/** INTMTX_CORE0_TG0_T0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_TG0_T0_INTR mapping register
 */
#define INTMTX_CORE0_TG0_T0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG0_T0_INTR_MAP_M  (INTMTX_CORE0_TG0_T0_INTR_MAP_V << INTMTX_CORE0_TG0_T0_INTR_MAP_S)
#define INTMTX_CORE0_TG0_T0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG0_T0_INTR_MAP_S  0

/** INTMTX_CORE0_TG0_WDT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xa8)
/** INTMTX_CORE0_TG0_WDT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_TG0_WDT_INTR mapping register
 */
#define INTMTX_CORE0_TG0_WDT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_M  (INTMTX_CORE0_TG0_WDT_INTR_MAP_V << INTMTX_CORE0_TG0_WDT_INTR_MAP_S)
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG0_WDT_INTR_MAP_S  0

/** INTMTX_CORE0_TG1_T0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG1_T0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xac)
/** INTMTX_CORE0_TG1_T0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_TG1_T0_INTR mapping register
 */
#define INTMTX_CORE0_TG1_T0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG1_T0_INTR_MAP_M  (INTMTX_CORE0_TG1_T0_INTR_MAP_V << INTMTX_CORE0_TG1_T0_INTR_MAP_S)
#define INTMTX_CORE0_TG1_T0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG1_T0_INTR_MAP_S  0

/** INTMTX_CORE0_TG1_WDT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb0)
/** INTMTX_CORE0_TG1_WDT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_TG1_WDT_INTR mapping register
 */
#define INTMTX_CORE0_TG1_WDT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_M  (INTMTX_CORE0_TG1_WDT_INTR_MAP_V << INTMTX_CORE0_TG1_WDT_INTR_MAP_S)
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_TG1_WDT_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb4)
/** INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_SYSTIMER_TARGET0_INTR mapping register
 */
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET0_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xb8)
/** INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_SYSTIMER_TARGET1_INTR mapping register
 */
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET1_INTR_MAP_S  0

/** INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xbc)
/** INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_SYSTIMER_TARGET2_INTR mapping register
 */
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_M  (INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_V << INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_S)
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_SYSTIMER_TARGET2_INTR_MAP_S  0

/** INTMTX_CORE0_APB_ADC_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_APB_ADC_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc0)
/** INTMTX_CORE0_APB_ADC_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_APB_ADC_INTR mapping register
 */
#define INTMTX_CORE0_APB_ADC_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_APB_ADC_INTR_MAP_M  (INTMTX_CORE0_APB_ADC_INTR_MAP_V << INTMTX_CORE0_APB_ADC_INTR_MAP_S)
#define INTMTX_CORE0_APB_ADC_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_APB_ADC_INTR_MAP_S  0

/** INTMTX_CORE0_PWM_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PWM_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc4)
/** INTMTX_CORE0_PWM_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PWM_INTR mapping register
 */
#define INTMTX_CORE0_PWM_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PWM_INTR_MAP_M  (INTMTX_CORE0_PWM_INTR_MAP_V << INTMTX_CORE0_PWM_INTR_MAP_S)
#define INTMTX_CORE0_PWM_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PWM_INTR_MAP_S  0

/** INTMTX_CORE0_PCNT_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PCNT_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xc8)
/** INTMTX_CORE0_PCNT_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PCNT_INTR mapping register
 */
#define INTMTX_CORE0_PCNT_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PCNT_INTR_MAP_M  (INTMTX_CORE0_PCNT_INTR_MAP_V << INTMTX_CORE0_PCNT_INTR_MAP_S)
#define INTMTX_CORE0_PCNT_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PCNT_INTR_MAP_S  0

/** INTMTX_CORE0_PARL_IO_TX_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PARL_IO_TX_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xcc)
/** INTMTX_CORE0_PARL_IO_TX_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PARL_IO_TX_INTR mapping register
 */
#define INTMTX_CORE0_PARL_IO_TX_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PARL_IO_TX_INTR_MAP_M  (INTMTX_CORE0_PARL_IO_TX_INTR_MAP_V << INTMTX_CORE0_PARL_IO_TX_INTR_MAP_S)
#define INTMTX_CORE0_PARL_IO_TX_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PARL_IO_TX_INTR_MAP_S  0

/** INTMTX_CORE0_PARL_IO_RX_INTR_MAP_REG register
 *  register description
 */
#define INTMTX_CORE0_PARL_IO_RX_INTR_MAP_REG (DR_REG_INTMTX_BASE + 0xd0)
/** INTMTX_CORE0_PARL_IO_RX_INTR_MAP : R/W; bitpos: [4:0]; default: 0;
 *  CORE0_PARL_IO_RX_INTR mapping register
 */
#define INTMTX_CORE0_PARL_IO_RX_INTR_MAP    0x0000001FU
#define INTMTX_CORE0_PARL_IO_RX_INTR_MAP_M  (INTMTX_CORE0_PARL_IO_RX_INTR_MAP_V << INTMTX_CORE0_PARL_IO_RX_INTR_MAP_S)
#define INTMTX_CORE0_PARL_IO_RX_INTR_MAP_V  0x0000001FU
#define INTMTX_CORE0_PARL_IO_RX_INTR_MAP_S  0

