espressif/esp-idf/components/soc/esp32h2/register/soc/interrupt_matrix_reg.h
/** INTMTX_CORE0_INT_STATUS_REG_2_REG register
 *  register description
 */
#define INTMTX_CORE0_INT_STATUS_REG_2_REG (DR_REG_INTMTX_BASE + 0x10c)
/** INTMTX_CORE0_INT_STATUS_2 : RO; bitpos: [31:0]; default: 0;
 *  Status register for interrupt sources 64~95 mapping register
 */
#define INTMTX_CORE0_INT_STATUS_2    0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_2_M  (INTMTX_CORE0_INT_STATUS_2_V << INTMTX_CORE0_INT_STATUS_2_S)
#define INTMTX_CORE0_INT_STATUS_2_V  0xFFFFFFFFU
#define INTMTX_CORE0_INT_STATUS_2_S  0

/** INTMTX_CORE0_CLOCK_GATE_REG register
 *  register description
 */
#define INTMTX_CORE0_CLOCK_GATE_REG (DR_REG_INTMTX_BASE + 0x110)
/** INTMTX_CORE0_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Clock register
 */
#define INTMTX_CORE0_REG_CLK_EN    (BIT(0))
#define INTMTX_CORE0_REG_CLK_EN_M  (INTMTX_CORE0_REG_CLK_EN_V << INTMTX_CORE0_REG_CLK_EN_S)
#define INTMTX_CORE0_REG_CLK_EN_V  0x00000001U
#define INTMTX_CORE0_REG_CLK_EN_S  0

/** INTMTX_CORE0_INTERRUPT_REG_DATE_REG register
 *  register description
 */
#define INTMTX_CORE0_INTERRUPT_REG_DATE_REG (DR_REG_INTMTX_BASE + 0x7fc)
/** INTMTX_CORE0_INTERRUPT_REG_DATE : R/W; bitpos: [27:0]; default: 35688784;
 *  Version control register
 */
#define INTMTX_CORE0_INTERRUPT_REG_DATE    0x0FFFFFFFU
#define INTMTX_CORE0_INTERRUPT_REG_DATE_M  (INTMTX_CORE0_INTERRUPT_REG_DATE_V << INTMTX_CORE0_INTERRUPT_REG_DATE_S)
#define INTMTX_CORE0_INTERRUPT_REG_DATE_V  0x0FFFFFFFU
#define INTMTX_CORE0_INTERRUPT_REG_DATE_S  0

#ifdef __cplusplus
}
#endif
